Before merge, verify that all the following plans are correct. They will be applied as-is after the merge.

#### Terraform plans
<details><summary>ipfs</summary>

```

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # github_repository_file.this["fs-repo-migrations/.github/dependabot.yml"] will be created
  + resource "github_repository_file" "this" {
      + branch              = "master"
      + commit_author       = "GitHub"
      + commit_email        = "noreply@github.com"
      + commit_message      = "chore: Update .github/dependabot.yml [skip ci]"
      + commit_sha          = (known after apply)
      + content             = <<-EOT
            version: 2
            updates:
              - package-ecosystem: "github-actions"
                directory: "/"
                schedule:
                  interval: "weekly"
        EOT
      + file                = ".github/dependabot.yml"
      + id                  = (known after apply)
      + overwrite_on_create = false
      + ref                 = (known after apply)
      + repository          = "fs-repo-migrations"
      + sha                 = (known after apply)
    }

  # github_repository_file.this["go-ds-crdt/.github/dependabot.yml"] will be updated in-place
  ~ resource "github_repository_file" "this" {
      + commit_author       = "GitHub"
      + commit_email        = "noreply@github.com"
      ~ commit_message      = <<-EOT
          - Upgrade to GitHub-native Dependabot (#96)
          - 
          - Co-authored-by: dependabot-preview[bot] <27856297+dependabot-preview[bot]@users.noreply.github.com>
          + chore: Update .github/dependabot.yml [skip ci]
        EOT
        id                  = "go-ds-crdt/.github/dependabot.yml"
        # (8 unchanged attributes hidden)
    }

  # github_repository_file.this["go-ipfs-priv/.github/dependabot.yml"] will be updated in-place
  ~ resource "github_repository_file" "this" {
      + commit_author       = "GitHub"
      + commit_email        = "noreply@github.com"
      ~ commit_message      = "chore: label dependabot PRs" -> "chore: Update .github/dependabot.yml [skip ci]"
        id                  = "go-ipfs-priv/.github/dependabot.yml"
        # (8 unchanged attributes hidden)
    }

  # github_repository_file.this["helia-car/.github/workflows/stale.yml"] will be updated in-place
  ~ resource "github_repository_file" "this" {
      + commit_author       = "GitHub"
      + commit_email        = "noreply@github.com"
      ~ commit_message      = "feat: initial import" -> "chore: Update .github/workflows/stale.yml [skip ci]"
        id                  = "helia-car/.github/workflows/stale.yml"
        # (8 unchanged attributes hidden)
    }

  # github_repository_file.this["helia-routing-v1-http-api/.github/workflows/stale.yml"] will be updated in-place
  ~ resource "github_repository_file" "this" {
      + commit_author       = "GitHub"
      + commit_email        = "noreply@github.com"
      ~ commit_message      = "feat: initial import" -> "chore: Update .github/workflows/stale.yml [skip ci]"
        id                  = "helia-routing-v1-http-api/.github/workflows/stale.yml"
        # (8 unchanged attributes hidden)
    }

  # github_repository_file.this["ipfs-blog/.github/dependabot.yml"] will be updated in-place
  ~ resource "github_repository_file" "this" {
      + commit_author       = "GitHub"
      + commit_email        = "noreply@github.com"
      ~ commit_message      = "chore: reduce dependabot frequency" -> "chore: Update .github/dependabot.yml [skip ci]"
        id                  = "ipfs-blog/.github/dependabot.yml"
        # (8 unchanged attributes hidden)
    }

  # github_repository_file.this["ipfs-docs/.github/dependabot.yml"] will be updated in-place
  ~ resource "github_repository_file" "this" {
      + commit_author       = "GitHub"
      + commit_email        = "noreply@github.com"
      ~ commit_message      = "fix(ci): dependabot" -> "chore: Update .github/dependabot.yml [skip ci]"
        id                  = "ipfs-docs/.github/dependabot.yml"
        # (8 unchanged attributes hidden)
    }

  # github_repository_file.this["kubo/.github/dependabot.yml"] will be updated in-place
  ~ resource "github_repository_file" "this" {
      + commit_author       = "GitHub"
      + commit_email        = "noreply@github.com"
      ~ commit_message      = "chore: label dependabot PRs" -> "chore: Update .github/dependabot.yml [skip ci]"
        id                  = "kubo/.github/dependabot.yml"
        # (8 unchanged attributes hidden)
    }

  # github_repository_file.this["public-gateway-checker/.github/dependabot.yml"] will be updated in-place
  ~ resource "github_repository_file" "this" {
      + commit_author       = "GitHub"
      + commit_email        = "noreply@github.com"
      ~ commit_message      = <<-EOT
          - feat: use typescript (#194)
          - 
          - * migrate classes to separate typescript files
          - 
          - * fixed all typescript errors
          - 
          - * add aegir
          - 
          - * compile new app.js: npx tsc
          - 
          - * add vscode config
          - 
          - * move app.js to dist/
          - 
          - * chore: improve dev setup
          - 
          - * chore: fix with aegir lint -f
          - 
          - * chore: replace all tab characters
          - 
          - * chore: fix majority of lint errors
          - 
          - * chore: clean up comments & fix docs
          - 
          - * run check-aegir-project
          - 
          - * remove docker publish action
          - 
          - * use dist folder
          - 
          - * publish github pages on push to master branch
          - 
          - * deploy to gh-pages on merge to master
          - 
          - * remove release job
          - 
          - * temporarily disable running test scripts
          - 
          - * clock icon no longer blocks flag icon
          - 
          - * create npm start script
          - 
          - * minor refactor, misc improvements; dep updates
          - 
          - * fix a few UI issues
          - 
          - * Bump typescript from 4.5.5 to 4.6.2
          - 
          - Bumps [typescript](https://github.com/Microsoft/TypeScript) from 4.5.5 to 4.6.2.
          - - [Release notes](https://github.com/Microsoft/TypeScript/releases)
          - - [Commits](https://github.com/Microsoft/TypeScript/compare/v4.5.5...v4.6.2)
          - 
          - ---
          - updated-dependencies:
          - - dependency-name: typescript
          -   dependency-type: direct:development
          -   update-type: version-update:semver-minor
          - ...
          - 
          - Signed-off-by: dependabot[bot] <support@github.com>
          - 
          - * feat: use jsipfs to publish to ipfs
          - 
          - * chore: fix package.json 'main' and 'files'
          - 
          - * fix: correct aegir settings & type failures
          - 
          - * use gh-pages
          - 
          - * fix: Cors onerror clears Tag
          - 
          - * revert ipfs client and ipfs-geoip versions
          - 
          - * CORS results update correctly
          - 
          - * All checks are async
          - 
          - * Online icon displays globe on success
          - 
          - * minor touchup
          - 
          - * commit serialized version of site before changes
          - 
          - The json was generated by rendering the public-gateway-checker locally, and then running the following snippet in the console:
          - 
          - ```javascript
          - console.log(JSON.stringify(Array.from(document.querySelectorAll('.Node')).map((el) => Array.from(el.querySelectorAll('div')).reduce((acc, item) => {
          - 
          -     let content = item.textContent
          - 
          -     if (item.className.includes('Flag')) {
          -         content = item.style.getPropertyValue('background-image')
          -     }
          -     if (item.className.includes('Took')) {
          -         // Do not serialized the time it took because it may always change
          -         return acc
          -     }
          -     acc[item.className] = content
          -     return acc
          - }, {})).sort((a, b) => {
          -     if (a.Link > b.Link) return 1
          -     if (a.Link < b.Link) return -1
          -     return 0
          - }), null, 2))
          - ```
          - 
          - * serialize changes after update
          - 
          - * fix origin checks
          - 
          - * #/# tested correctly updates
          - 
          - Also fixed online checks. All gateways show online. Verified manually by clicking each link
          - 
          - * runaway fixes...
          - 
          - * Update package.json
          - 
          - Co-authored-by: Marcin Rataj <lidel@lidel.org>
          - 
          - * Update .github/workflows/js-test-and-release.yml
          - 
          - Co-authored-by: Marcin Rataj <lidel@lidel.org>
          - 
          - * Update .github/workflows/build-and-publish-github-pages.yml
          - 
          - Co-authored-by: Marcin Rataj <lidel@lidel.org>
          - 
          - * use versioned rate-limter pkg
          - 
          - * comment out test github actions
          - 
          - Co-authored-by: dependabot[bot] <49699333+dependabot[bot]@users.noreply.github.com>
          - Co-authored-by: Marcin Rataj <lidel@lidel.org>
          + chore: Update .github/dependabot.yml [skip ci]
        EOT
        id                  = "public-gateway-checker/.github/dependabot.yml"
        # (8 unchanged attributes hidden)
    }

Plan: 1 to add, 8 to change, 0 to destroy.
```

</details>
<!-- Sticky Pull Request Comment -->